<template>
  <div>
    <Header></Header>
    <div class="mainbox">
      <ul class="clearfix">
        <li style="width:30%">
          <div class="boxall"
               style="height: 3.7rem">
            <div class="alltitle">实时监控</div>
            <div class="allnav"
                 id="echart1">
              <video-player class="video-player vjs-custom-skin"
                            ref="videoPlayer1"
                            :options="playerOptions1"></video-player>
            </div>
            <div class="boxfoot"></div>
          </div>
          <div class="boxall"
               style="height: 1.2rem">
            <!-- <div class="alltitle">未带口罩人员截图区域</div> -->
            <div id="demo">
              <div id="indemo">
                <div id="demo1">
                  <img :src="staticUrl2 + item.img"
                       v-for="item in this.noMask"
                       :key="item.title" />
                </div>
                <div id="demo2">
                  <img :src="staticUrl2  + item.img"
                       v-for="item in this.noMask"
                       :key="item.title" />
                </div>
              </div>
            </div>
            <div class="boxfoot"></div>
          </div>
          <div class="boxall"
               style="height: 4.7rem;">
            <div class="alltitle">战“疫”频道</div>
            <div class="allnav"
                 id="echart3">
              <Tabs v-model="activename"
                    type="card">
                <TabPane label="诊　断"
                         name="name1"
                         id="resou"></TabPane>
                <TabPane label="知　识"
                         name="name2"
                         id="zhishi"></TabPane>
                <TabPane label="辟　谣"
                         name="name3"
                         class="piyao">
                  <ul>
                    <li class="piyao_list1"
                        v-for="item in this.piyao"
                        :key="item.title">【谣】{{item.title}}</li>
                  </ul>
                </TabPane>
              </Tabs>
            </div>
            <div class="boxfoot"></div>
          </div>
        </li>
        <li style="width:40%">
          <div class="bar">
            <div class="barbox">
              <ul class="clearfix">
                <li class="pulll_left counter"
                    style="width:40%;">{{ statistics.sumAll }} - {{ statistics.sumAll }}</li>
                <li class="pulll_left counter"
                    style="width:40%;">{{ statistics.stuinJiang }} - {{ statistics.stuinSuzhou }}</li>
                <!-- <li class="pulll_left counter" style="width:25%;">{{ statistics.upTime }}</li> -->
                <li class="pulll_left counter"
                    style="width:20%;">
                  {{statistics.sumGreen}}
                  <!-- <div id="fashao"></div> -->
                </li>
              </ul>
            </div>
            <div class="barbox2">
              <ul class="clearfix">
                <li class="pulll_left"
                    style="width:40%;">系部人数 - 上报人数</li>
                <li class="pulll_left"
                    style="width:40%;">返苏人数（江苏-苏州）</li>
                <!-- <li class="pulll_left" style="width:25%;">更新时间</li> -->
                <li class="pulll_left"
                    style="width:20%;">绿码人数</li>
              </ul>
            </div>
          </div>
          <div class="map">
            <div class="suzhouNum"
                 id="polo_1">
              <div class="boxfoot"></div>
            </div>
            <div class="cityNum"
                 id="polo_2">
              <div class="boxfoot"></div>
            </div>
            <div class="map41"
                 id="map_1"></div>
          </div>
          <div class="boxallcard"
               style="height: 2.6rem">
            <!-- <div class="alltitle">停课不停学图片走马灯卡片式轮播</div> -->
            <div class="allnav"
                 id="echart5">
              <el-carousel :interval="2000"
                           type="card"
                           height="2rem">
                <el-carousel-item v-for="item in this.img_list"
                                  :key="item.img">
                  <img :src="staticUrl + '/img/' + item.img" />
                </el-carousel-item>
              </el-carousel>
            </div>
            <div class="boxfootcard"></div>
          </div>
        </li>
        <li style="width:30%">
          <div class="boxall"
               style="height:3.7rem">
            <div class="alltitle">防疫宣传视频</div>
            <div class="allnav"
                 id="echart4">
              <video-player class="video-player vjs-custom-skin"
                            ref="videoPlayer"
                            :options="playerOptions2"></video-player>
            </div>
            <div class="boxfoot"></div>
          </div>
          <div class="boxallinfo"
               style="height: 3rem;">
            <div class="alltitle">苏城码颜色占比</div>
            <div class="allnav"
                 id="main8"
                 style="height:2.4rem"></div>
            <div class="boxfoot"></div>
          </div>
          <div class="boxall"
               style="height: 2.85rem;">
            <div class="kebiaotitle">
              <div class="select"
                   style="width:25%;float:left">
                <el-dropdown @command="handleCommand1">
                  <span class="el-dropdown-link">
                    18级
                    <i class="el-icon-arrow-down el-icon--right"></i>
                  </span>
                  <el-dropdown-menu slot="dropdown">
                    <el-dropdown-item command="rj18c2">软件18C2</el-dropdown-item>
                    <el-dropdown-item command="rj18c1">软件18C1</el-dropdown-item>
                    <el-dropdown-item command="dsj18c1">大数据18C1</el-dropdown-item>
                    <el-dropdown-item command="dl18c1">动联18C1</el-dropdown-item>
                    <el-dropdown-item command="wl18c1">网络18C1</el-dropdown-item>
                    <el-dropdown-item command="wl18d1">网络18D1</el-dropdown-item>
                    <el-dropdown-item command="xg18h1">信管18H1</el-dropdown-item>
                    <el-dropdown-item command="xx18d1">信息18D1</el-dropdown-item>
                    <el-dropdown-item command="yjs18c1">云计算18C1</el-dropdown-item>
                  </el-dropdown-menu>
                </el-dropdown>

                <el-dropdown @command="handleCommand2">
                  <span class="el-dropdown-link">
                    19级
                    <i class="el-icon-arrow-down el-icon--right"></i>
                  </span>
                  <el-dropdown-menu slot="dropdown">
                    <el-dropdown-item command="rj19c1">软件19C1</el-dropdown-item>
                    <el-dropdown-item command="rj19c2">软件19C2</el-dropdown-item>
                    <el-dropdown-item command="dsj19c1">大数据19C1</el-dropdown-item>
                    <el-dropdown-item command="dl19c1">动联19C1</el-dropdown-item>
                    <el-dropdown-item command="wl19c1">网络19C1</el-dropdown-item>
                    <el-dropdown-item command="wl19d1">网络19D1</el-dropdown-item>
                    <el-dropdown-item command="xx19c1">信息19C1</el-dropdown-item>
                    <el-dropdown-item command="xx19d1">信息19D1</el-dropdown-item>
                    <el-dropdown-item command="yjs19c1">云计算19C1</el-dropdown-item>
                    <el-dropdown-item command="yjs19c2">云计算19C2</el-dropdown-item>
                    <el-dropdown-item command="jqr19c1">机器人19C1</el-dropdown-item>
                    <el-dropdown-item command="jqr19c2">机器人19C2</el-dropdown-item>
                  </el-dropdown-menu>
                </el-dropdown>
              </div>
              <div class="select"
                   style="width:55%;float:left">{{this.class}}课程情况（第三周）</div>
              <div class="zhiban"
                   style="width:20%;float:left">
                值班&nbsp;: &nbsp;
                <span style="font-weight:1000;">{{this.zhiban}}</span>
              </div>
            </div>
            <div id="echart6"></div>
            <div class="boxfoot"></div>
          </div>
        </li>
      </ul>
    </div>
    <div class="back"></div>
  </div>
</template>

<script>
import echarts from "echarts";
import "echarts-wordcloud/dist/echarts-wordcloud";
import "echarts-wordcloud/dist/echarts-wordcloud.min";
import "videojs-flash";
import "video.js/dist/video-js.css";
import "vue-video-player/src/custom-theme.css";
import { videoPlayer } from "vue-video-player";
import Header from "@/components/header";
export default {
  data () {
    return {
      activename: "name1",
      // 宏观指数 系部（上报）、返苏（江苏-苏州）、隔离、发烧人数
      statistics: {
        sumAll: 0,
        upTime: 0,
        sumGreen: 0,
        stuinSuzhou: 0,
        stuinJiang: 0
      },
      //重点关注学生信息
      stuInfo: [],
      //轮播图图片
      img_list: [],
      //苏城码占比
      sucityNum: [],
      // 口罩图片列表
      noMask: [],
      // 静态资源地址
      staticUrl: this.staticUrl,
      staticUrl2: this.staticUrl2,
      //值班老师
      zhiban: null,
      // 辟谣信息列表
      piyao: [],
      class: "软件18C2",
      timer: null, //定时器名称
      playerOptions1: {
        // playbackRates: [0.7, 1.0, 1.5, 2.0], //播放速度
        autoplay: true, //如果true,浏览器准备好时开始回放。
        muted: false, // 默认情况下将会消除任何音频。
        loop: false, // 导致视频一结束就重新开始。
        preload: "auto", // 建议浏览器在<video>加载元素后是否应该开始下载视频数据。auto浏览器选择最佳行为,立即开始加载视频（如果浏览器支持）
        language: "zh-CN",
        aspectRatio: "16:9", // 将播放器置于流畅模式，并在计算播放器的动态大小时使用该值。值应该代表一个比例 - 用冒号分隔的两个数字（例如"16:9"或"4:3"）
        fluid: true, // 当true时，Video.js player将拥有流体大小。换句话说，它将按比例缩放以适应其容器。
        // 将播放器置于流畅模式，并在计算播放器的动态大小时使用该值。值应该代表一个比例 - 用冒号分隔的两个数字（例如"16:9"或"4:3"）
        techOrder: ["flash", "html5"], // 兼容顺序
        flash: {
          hls: { withCredentials: false },
          swf: "static/video-js.swf" // 引入静态文件swf
        },
        html5: { hls: { withCredentials: false } },
        sources: [
          {
            // 流配置，数组形式，会根据兼容顺序自动切换
            type: "rtmp/mp4",
            src: "rtmp://139.224.68.139:1935/play/mask.mp4"
          }
        ],
        poster: "", //你的封面地址
        // width: document.documentElement.clientWidth,
        notSupportedMessage: "此视频暂无法播放，请稍后再试", // 允许覆盖Video.js无法播放媒体源时显示的默认信息。
        controlBar: false
      },
      playerOptions2: {
        playbackRates: [0.7, 1.0, 1.5, 2.0], //播放速度
        autoplay: true, //如果true,浏览器准备好时开始回放。
        muted: false, // 默认情况下将会消除任何音频。
        loop: true, // 导致视频一结束就重新开始。
        preload: "auto", // 建议浏览器在<video>加载元素后是否应该开始下载视频数据。auto浏览器选择最佳行为,立即开始加载视频（如果浏览器支持）
        language: "zh-CN",
        aspectRatio: "16:9", // 将播放器置于流畅模式，并在计算播放器的动态大小时使用该值。值应该代表一个比例 - 用冒号分隔的两个数字（例如"16:9"或"4:3"）
        fluid: true, // 当true时，Video.js player将拥有流体大小。换句话说，它将按比例缩放以适应其容器。
        // 将播放器置于流畅模式，并在计算播放器的动态大小时使用该值。值应该代表一个比例 - 用冒号分隔的两个数字（例如"16:9"或"4:3"）
        techOrder: ["flash", "html5"], // 兼容顺序
        flash: {
          hls: { withCredentials: false },
          swf: "static/video-js.swf" // 引入静态文件swf
        },
        html5: { hls: { withCredentials: false } },
        sources: [
          {
            // 流配置，数组形式，会根据兼容顺序自动切换
            type: "video/mp4",
            src: this.staticUrl + "/video/1.mp4" //url地址
          }
        ],
        poster: "", //你的封面地址
        // width: document.documentElement.clientWidth,
        notSupportedMessage: "此视频暂无法播放，请稍后再试", // 允许覆盖Video.js无法播放媒体源时显示的默认信息。
        controlBar: {
          timeDivider: true,
          durationDisplay: true,
          remainingTimeDisplay: false,
          fullscreenToggle: true //全屏按钮
        }
      },
      rj18c2: [
        [
          1,
          4,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],
        [
          1,
          5,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],
        [
          1,
          6,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],
        [
          1,
          7,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],

        [
          2,
          0,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ],
        [
          2,
          1,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ],
        [
          2,
          2,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ],
        [
          2,
          3,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ]
      ],
      rj19c1: [
        [
          0,
          0,
          1,
          "芮文艳",
          "JavaScript程序设计",
          "1-4",
          "企业微信会议音频课 ",
          "43"
        ],
        [
          0,
          1,
          1,
          "芮文艳",
          "JavaScript程序设计",
          "1-4",
          "企业微信会议音频课 ",
          "43"
        ],
        [
          0,
          2,
          1,
          "芮文艳",
          "JavaScript程序设计",
          "1-4",
          "企业微信会议音频课 ",
          "43"
        ],
        [
          0,
          3,
          1,
          "芮文艳",
          "JavaScript程序设计",
          "1-4",
          "企业微信会议音频课 ",
          "43"
        ],

        [
          0,
          4,
          1,
          "朱东",
          "关系数据库基础与应用",
          "5-6",
          "企业微信会议直播",
          "47"
        ],
        [
          0,
          5,
          1,
          "朱东",
          "关系数据库基础与应用",
          "5-6",
          "企业微信会议直播",
          "47"
        ],

        [
          1,
          0,
          1,
          "刘文军",
          "JAVA面向对象编程",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "47"
        ],
        [
          1,
          1,
          1,
          "刘文军",
          "JAVA面向对象编程",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "47"
        ],
        [
          1,
          2,
          1,
          "刘文军",
          "JAVA面向对象编程",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "47"
        ],
        [
          1,
          3,
          1,
          "刘文军",
          "JAVA面向对象编程",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "47"
        ],

        [
          3,
          4,
          1,
          "刘文军",
          "JAVA面向对象编程",
          "5-6",
          "教学平台资源发布、企业微信会议辅导和答疑",
          "47"
        ],
        [
          3,
          5,
          1,
          "刘文军",
          "JAVA面向对象编程",
          "5-6",
          "教学平台资源发布、企业微信会议辅导和答疑",
          "47"
        ],

        [
          4,
          0,
          1,
          "吴阅帆",
          "Linux系统管理C",
          "1-4",
          "多平台远程指导学生安装虚拟机及Linux",
          "45"
        ],
        [
          4,
          1,
          1,
          "吴阅帆",
          "Linux系统管理C",
          "1-4",
          "多平台远程指导学生安装虚拟机及Linux",
          "45"
        ],
        [
          4,
          2,
          1,
          "吴阅帆",
          "Linux系统管理C",
          "1-4",
          "多平台远程指导学生安装虚拟机及Linux",
          "45"
        ],
        [
          4,
          3,
          1,
          "吴阅帆",
          "Linux系统管理C",
          "1-4",
          "多平台远程指导学生安装虚拟机及Linux",
          "45"
        ]
      ],
      dsj18c1: [
        [
          0,
          0,
          1,
          "黄金晶",
          "软件工程与建模",
          "1-4",
          "网络平台不太稳定，后续在群里发送资源进行学习",
          "平台不稳定，未签到"
        ],
        [
          0,
          1,
          1,
          "黄金晶",
          "软件工程与建模",
          "1-4",
          "网络平台不太稳定，后续在群里发送资源进行学习",
          "平台不稳定，未签到"
        ],
        [
          0,
          2,
          1,
          "黄金晶",
          "软件工程与建模",
          "1-4",
          "网络平台不太稳定，后续在群里发送资源进行学习",
          "平台不稳定，未签到"
        ],
        [
          0,
          3,
          1,
          "黄金晶",
          "软件工程与建模",
          "1-4",
          "网络平台不太稳定，后续在群里发送资源进行学习",
          "平台不稳定，未签到"
        ],

        [
          1,
          0,
          1,
          "艾旭升",
          "大数据实时应用开发",
          "1-2",
          "企业微信直播与网络平台结合上课",
          "39"
        ],
        [
          1,
          1,
          1,
          "艾旭升",
          "大数据实时应用开发",
          "1-2",
          "企业微信直播与网络平台结合上课",
          "39"
        ],

        [
          2,
          0,
          1,
          "李良",
          "数据可视化编程和操作",
          "1-4",
          "QQ群直播",
          "应到44人,迟到2人"
        ],
        [
          2,
          1,
          1,
          "李良",
          "数据可视化编程和操作",
          "1-4",
          "QQ群直播",
          "应到44人,迟到2人"
        ],
        [
          2,
          2,
          1,
          "李良",
          "数据可视化编程和操作",
          "1-4",
          "QQ群直播",
          "应到44人,迟到2人"
        ],
        [
          2,
          3,
          1,
          "李良",
          "数据可视化编程和操作",
          "1-4",
          "QQ群直播",
          "应到44人,迟到2人"
        ],

        [
          3,
          0,
          1,
          "郝爱语",
          "大数据应用测试技术和工具",
          "1-2",
          "共享教学资源至班级群,自主学习,不懂的地方及时联系教师",
          "44"
        ],
        [
          3,
          1,
          1,
          "郝爱语",
          "大数据应用测试技术和工具",
          "1-2",
          "共享教学资源至班级群,自主学习,不懂的地方及时联系教师",
          "44"
        ]
      ],
      dsj19c1: [
        [
          0,
          0,
          1,
          "艾旭升",
          " Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "完成作业8人"
        ],
        [
          0,
          1,
          1,
          "艾旭升",
          " Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "完成作业8人"
        ],
        [
          0,
          2,
          1,
          "艾旭升",
          " Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "完成作业8人"
        ],
        [
          0,
          3,
          1,
          "艾旭升",
          " Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "完成作业8人"
        ],

        [
          0,
          4,
          1,
          "杨小英",
          "关系数据库基础与应用",
          "5-6",
          "网络平台，企业微信群、QQ群上答疑",
          "31"
        ],
        [
          0,
          5,
          1,
          "杨小英",
          "关系数据库基础与应用",
          "5-6",
          "网络平台，企业微信群、QQ群上答疑",
          "31"
        ],

        [1, 0, 1, "杨小英", "Web前端技术基础", "1-4", "企业微信直播", "31"],
        [1, 1, 1, "杨小英", "Web前端技术基础", "1-4", "企业微信直播", "31"],
        [1, 2, 1, "杨小英", "Web前端技术基础", "1-4", "企业微信直播", "31"],
        [1, 3, 1, "杨小英", "Web前端技术基础", "1-4", "企业微信直播", "31"],

        [
          2,
          0,
          1,
          "杨小英",
          "关系数据库基础与应用",
          "1-4",
          "企业微信直播、互动交流",
          "32"
        ],
        [
          2,
          1,
          1,
          "杨小英",
          "关系数据库基础与应用",
          "1-4",
          "企业微信直播、互动交流",
          "32"
        ],
        [
          2,
          2,
          1,
          "杨小英",
          "关系数据库基础与应用",
          "1-4",
          "企业微信直播、互动交流",
          "32"
        ],
        [
          2,
          3,
          1,
          "杨小英",
          "关系数据库基础与应用",
          "1-4",
          "企业微信直播、互动交流",
          "32"
        ]
      ],
      dl18c1: [
        [0, 4, 1, "雷晖", " 框架编程技术", "5-6", "QQ视频完成教学", "42"],
        [0, 5, 1, "雷晖", " 框架编程技术", "5-6", "QQ视频完成教学", "42"],

        [
          2,
          0,
          1,
          "罗颖",
          " 微信小程序开发",
          "1-4",
          "企业微信音频会议、屏幕分享、讲解重点互动",
          "44"
        ],
        [
          2,
          1,
          1,
          "罗颖",
          " 微信小程序开发",
          "1-4",
          "企业微信音频会议、屏幕分享、讲解重点互动",
          "44"
        ],
        [
          2,
          2,
          1,
          "罗颖",
          " 微信小程序开发",
          "1-4",
          "企业微信音频会议、屏幕分享、讲解重点互动",
          "44"
        ],
        [
          2,
          3,
          1,
          "罗颖",
          " 微信小程序开发",
          "1-4",
          "企业微信音频会议、屏幕分享、讲解重点互动",
          "44"
        ],

        [
          3,
          2,
          1,
          "李春华",
          " Linux系统管理B",
          "3-4",
          "企业微信语音会议、屏幕分享",
          "44"
        ],
        [
          3,
          3,
          1,
          "李春华",
          " Linux系统管理B",
          "3-4",
          "企业微信语音会议、屏幕分享",
          "44"
        ]
      ],
      dl19c1: [
        [
          0,
          0,
          1,
          "张伟华",
          " 关系数据库基础与应用",
          "1-4",
          "智慧职教平台,QQ答疑",
          "24"
        ],
        [
          0,
          1,
          1,
          "张伟华",
          " 关系数据库基础与应用",
          "1-4",
          "智慧职教平台,QQ答疑",
          "24"
        ],
        [
          0,
          2,
          1,
          "张伟华",
          " 关系数据库基础与应用",
          "1-4",
          "智慧职教平台,QQ答疑",
          "24"
        ],
        [
          0,
          3,
          1,
          "张伟华",
          " 关系数据库基础与应用",
          "1-4",
          "智慧职教平台,QQ答疑",
          "24"
        ],

        [
          1,
          0,
          1,
          "栾咏红",
          " 面向对象程序设计（JAVA）",
          "1-4",
          "观看教学视频,PDF文档资料,QQ在线答疑",
          "27"
        ],
        [
          1,
          1,
          1,
          "栾咏红",
          " 面向对象程序设计（JAVA）",
          "1-4",
          "观看教学视频,PDF文档资料,QQ在线答疑",
          "27"
        ],
        [
          1,
          2,
          1,
          "栾咏红",
          " 面向对象程序设计（JAVA）",
          "1-4",
          "观看教学视频,PDF文档资料,QQ在线答疑",
          "29"
        ],
        [
          1,
          3,
          1,
          "栾咏红",
          " 面向对象程序设计（JAVA）",
          "1-4",
          "观看教学视频,PDF文档资料,QQ在线答疑",
          "29"
        ],

        [
          2,
          0,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "企业微信音频会议+屏幕共享,云班课互动,教学资源学习",
          "28人，3人睡过，1人家里没有网络"
        ],
        [
          2,
          1,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "企业微信音频会议+屏幕共享,云班课互动,教学资源学习",
          "28人，3人睡过，1人家里没有网络"
        ],
        [
          2,
          2,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "企业微信音频会议+屏幕共享,云班课互动,教学资源学习",
          "28人，3人睡过，1人家里没有网络"
        ],
        [
          2,
          3,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "企业微信音频会议+屏幕共享,云班课互动,教学资源学习",
          "28人，3人睡过，1人家里没有网络"
        ],

        [
          4,
          0,
          1,
          "李春华",
          " Linux系统管理C",
          "1-2",
          "企业微信语音会议+网络教学平台+优慕课APP",
          "32"
        ],
        [
          4,
          1,
          1,
          "李春华",
          " Linux系统管理C",
          "1-2",
          "企业微信语音会议+网络教学平台+优慕课APP",
          "32"
        ],
        [
          4,
          4,
          1,
          "李春华",
          " Linux系统管理C",
          "5-6",
          "企业微信语音会议+网络教学平台+优慕课APP",
          "30"
        ],
        [
          4,
          5,
          1,
          "李春华",
          " Linux系统管理C",
          "5-6",
          "企业微信语音会议+网络教学平台+优慕课APP",
          "30"
        ]
      ],
      rj18c1: [
        [
          0,
          0,
          1,
          "郝爱语",
          " 软件质量保证与测试",
          "1-4",
          "发放教学资源至班级QQ群,规定当日12点之前提交作业任务",
          "45"
        ],
        [
          0,
          1,
          1,
          "郝爱语",
          " 软件质量保证与测试",
          "1-4",
          "发放教学资源至班级QQ群,规定当日12点之前提交作业任务",
          "45"
        ],
        [
          0,
          2,
          1,
          "郝爱语",
          " 软件质量保证与测试",
          "1-4",
          "发放教学资源至班级QQ群,规定当日12点之前提交作业任务",
          "45"
        ],
        [
          0,
          3,
          1,
          "郝爱语",
          " 软件质量保证与测试",
          "1-4",
          "发放教学资源至班级QQ群,规定当日12点之前提交作业任务",
          "45"
        ],

        [
          1,
          0,
          1,
          "王喜",
          " 框架编程技术",
          "1-2",
          "网络教学平台发布资源,企业微信群解答",
          "未说明"
        ],
        [
          1,
          1,
          1,
          "王喜",
          " 框架编程技术",
          "1-2",
          "网络教学平台发布资源,企业微信群解答",
          "未说明"
        ],

        [
          3,
          0,
          1,
          "王喜",
          " 框架编程技术",
          "1-2",
          "企业微信直播,直播间讨论",
          "38"
        ],
        [
          3,
          1,
          1,
          "王喜",
          " 框架编程技术",
          "1-2",
          "企业微信直播,直播间讨论",
          "38"
        ]
      ],
      rj19c2: [
        [0, 0, 1, "栾咏红", " Java程序设计", "1-4", "QQ留言解答问题", "34"],
        [0, 1, 1, "栾咏红", " Java程序设计", "1-4", "QQ留言解答问题", "34"],
        [0, 2, 1, "栾咏红", " Java程序设计", "1-4", "QQ留言解答问题", "42"],
        [0, 3, 1, "栾咏红", " Java程序设计", "1-4", "QQ留言解答问题", "42"],

        [
          0,
          4,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "5-6",
          "云班课完成课程",
          "45"
        ],
        [
          0,
          5,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "5-6",
          "云班课完成课程",
          "45"
        ],

        [
          1,
          0,
          1,
          "芮文艳",
          " JavaScript程序设计",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "44"
        ],
        [
          1,
          1,
          1,
          "芮文艳",
          " JavaScript程序设计",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "44"
        ],
        [
          1,
          2,
          1,
          "芮文艳",
          " JavaScript程序设计",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "44"
        ],
        [
          1,
          3,
          1,
          "芮文艳",
          " JavaScript程序设计",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "44"
        ],

        [
          1,
          4,
          1,
          "吴阅帆",
          " Linux系统管理C",
          "5-6",
          "多平台指导学生安装虚拟机及Linux",
          "未签到"
        ],
        [
          1,
          5,
          1,
          "吴阅帆",
          " Linux系统管理C",
          "5-6",
          "多平台指导学生安装虚拟机及Linux",
          "未签到"
        ],

        [
          3,
          4,
          1,
          "栾咏红",
          " JAVA面向对象编程",
          "5-6",
          "观看教学资料,QQ在线答疑",
          "27"
        ],
        [
          3,
          5,
          1,
          "栾咏红",
          " JAVA面向对象编程",
          "5-6",
          "观看教学资料,QQ在线答疑",
          "29"
        ],

        [
          3,
          0,
          1,
          "吴阅帆",
          " Linux系统管理C",
          "1-2",
          "多平台远程指导学生",
          "43"
        ],
        [
          3,
          1,
          1,
          "吴阅帆",
          " Linux系统管理C",
          "1-2",
          "多平台远程指导学生",
          "43"
        ],

        [
          4,
          0,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "微信会议共享屏幕语音讲解,云班课讨论",
          "实到43人,缺席2人"
        ],
        [
          4,
          1,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "微信会议共享屏幕语音讲解,云班课讨论",
          "实到43人,缺席2人"
        ],
        [
          4,
          2,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "微信会议共享屏幕语音讲解,云班课讨论",
          "实到43人,缺席2人"
        ],
        [
          4,
          3,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "微信会议共享屏幕语音讲解,云班课讨论",
          "实到43人,缺席2人"
        ]
      ],
      wl18c1: [
        [
          0,
          0,
          1,
          "刘宝莲",
          " AutoCAD A",
          "1-4",
          "云班课线上学习PPT和视频,轻视频讨论和作业交流",
          "45"
        ],
        [
          0,
          1,
          1,
          "刘宝莲",
          " AutoCAD A",
          "1-4",
          "云班课线上学习PPT和视频,轻视频讨论和作业交流",
          "45"
        ],
        [
          0,
          2,
          1,
          "刘宝莲",
          " AutoCAD A",
          "1-4",
          "云班课线上学习PPT和视频,轻视频讨论和作业交流",
          "45"
        ],
        [
          0,
          3,
          1,
          "刘宝莲",
          " AutoCAD A",
          "1-4",
          "云班课线上学习PPT和视频,轻视频讨论和作业交流",
          "45"
        ],

        [
          0,
          4,
          1,
          "刘文军",
          " Python程序设计A",
          "5-6",
          "职教云平台在线学习,企业微信直播、答疑",
          "未签到"
        ],
        [
          0,
          5,
          1,
          "刘文军",
          " Python程序设计A",
          "5-6",
          "职教云平台在线学习,企业微信直播、答疑",
          "未签到"
        ],

        [1, 0, 1, "王东海", " 网络安全技术", "1-4", "网络教学平台", "37"],
        [1, 1, 1, "王东海", " 网络安全技术", "1-4", "网络教学平台", "37"],
        [1, 2, 1, "王东海", " 网络安全技术", "1-4", "网络教学平台", "37"],
        [1, 3, 1, "王东海", " 网络安全技术", "1-4", "网络教学平台", "37"],

        [
          2,
          0,
          1,
          "顾红燕",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频、完成作业,企业微信会议直播",
          "48人，2人未到"
        ],
        [
          2,
          1,
          1,
          "顾红燕",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频、完成作业,企业微信会议直播",
          "48人，2人未到"
        ],
        [
          2,
          2,
          1,
          "顾红燕",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频、完成作业,企业微信会议直播",
          "48人，2人未到"
        ],
        [
          2,
          3,
          1,
          "顾红燕",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频、完成作业,企业微信会议直播",
          "48人，2人未到"
        ],

        [
          3,
          0,
          1,
          "王东海",
          " 综合布线技术",
          "1-2",
          "微课、PPT学习、练习，在线答疑",
          "43"
        ],
        [
          3,
          1,
          1,
          "王东海",
          " 综合布线技术",
          "1-2",
          "微课、PPT学习、练习，在线答疑",
          "46"
        ],
        [
          3,
          2,
          1,
          "刘文军",
          " Python程序设计A",
          "3-4",
          "职教云学习、企业微信语言会议辅导和答疑",
          "50"
        ],
        [
          3,
          3,
          1,
          "刘文军",
          " Python程序设计A",
          "3-4",
          "职教云学习、企业微信语言会议辅导和答疑",
          "50"
        ]
      ],
      wl18d1: [
        [
          0,
          0,
          1,
          "顾红艳",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频，网络平台上传作业",
          "43"
        ],
        [
          0,
          1,
          1,
          "顾红艳",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频，网络平台上传作业",
          "43"
        ],
        [
          0,
          2,
          1,
          "顾红艳",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频，网络平台上传作业",
          "43"
        ],
        [
          0,
          3,
          1,
          "顾红艳",
          " 云计算架构技术与实践",
          "1-4",
          "云班课学习PPT和视频，网络平台上传作业",
          "43"
        ],

        [
          2,
          0,
          1,
          "王东海",
          " 网络安全技术",
          "1-4",
          "看视频,成练习提交平台,在线答疑",
          "38人，1人未到"
        ],
        [
          2,
          1,
          1,
          "王东海",
          " 网络安全技术",
          "1-4",
          "看视频,成练习提交平台,在线答疑",
          "38人，1人未到"
        ],
        [
          2,
          2,
          1,
          "王东海",
          " 网络安全技术",
          "1-4",
          "看视频,成练习提交平台,在线答疑",
          "38人，1人未到"
        ],
        [
          2,
          3,
          1,
          "王东海",
          " 网络安全技术",
          "1-4",
          "看视频,成练习提交平台,在线答疑",
          "38人，1人未到"
        ],

        [
          3,
          0,
          1,
          "时荣",
          " WEB安全渗透",
          "1-4",
          "企业微信直播,视频,完成实验报告一份",
          "44"
        ],
        [
          3,
          1,
          1,
          "时荣",
          " WEB安全渗透",
          "1-4",
          "企业微信直播,视频,完成实验报告一份",
          "44"
        ],
        [
          3,
          2,
          1,
          "时荣",
          " WEB安全渗透",
          "1-4",
          "企业微信直播,视频,完成实验报告一份",
          "44"
        ],
        [
          3,
          3,
          1,
          "时荣",
          " WEB安全渗透",
          "1-4",
          "企业微信直播,视频,完成实验报告一份",
          "44"
        ],

        [4, 0, 1, "刘宝莲", " 综合布线技术", "1-2", "云班课线上学习学习", "44"],
        [4, 1, 1, "刘宝莲", " 综合布线技术", "1-2", "云班课线上学习学习", "44"]
      ],
      wl19c1: [
        [
          0,
          0,
          1,
          "何亮",
          "  Linux系统管理C",
          "1-4",
          "QQ答疑，企业微信视频20分钟",
          "30"
        ],
        [
          0,
          1,
          1,
          "何亮",
          "  Linux系统管理C",
          "1-4",
          "QQ答疑，企业微信视频20分钟",
          "30"
        ],
        [
          0,
          2,
          1,
          "何亮",
          "  Linux系统管理C",
          "1-4",
          "QQ答疑，企业微信视频20分钟",
          "30"
        ],
        [
          0,
          3,
          1,
          "何亮",
          "  Linux系统管理C",
          "1-4",
          "QQ答疑，企业微信视频20分钟",
          "30"
        ],

        [
          0,
          4,
          1,
          "孙伟",
          "  关系数据库基础与应用",
          "5-8",
          "网络教学平台，但是效果不太好",
          "30"
        ],
        [
          0,
          5,
          1,
          "孙伟",
          "  关系数据库基础与应用",
          "5-8",
          "网络教学平台，但是效果不太好",
          "30"
        ],
        [
          0,
          6,
          1,
          "孙伟",
          "  关系数据库基础与应用",
          "5-8",
          "网络教学平台，但是效果不太好",
          "30"
        ],
        [
          0,
          7,
          1,
          "孙伟",
          "  关系数据库基础与应用",
          "5-8",
          "网络教学平台，但是效果不太好",
          "30"
        ],

        [
          1,
          0,
          1,
          "陈园园",
          " Web前端技术基础",
          "1-4",
          "网络教学平台学习,企业微信答疑",
          "31"
        ],
        [
          1,
          1,
          1,
          "陈园园",
          " Web前端技术基础",
          "1-4",
          "网络教学平台学习,企业微信答疑",
          "31"
        ],
        [
          1,
          2,
          1,
          "陈园园",
          " Web前端技术基础",
          "1-4",
          "网络教学平台学习,企业微信答疑",
          "31"
        ],
        [
          1,
          3,
          1,
          "陈园园",
          " Web前端技术基础",
          "1-4",
          "网络教学平台学习,企业微信答疑",
          "31"
        ],

        [
          2,
          0,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "企业微信语音会议",
          "31"
        ],
        [
          2,
          1,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "企业微信语音会议",
          "31"
        ],
        [
          2,
          2,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "企业微信语音会议",
          "31"
        ],
        [
          2,
          3,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "企业微信语音会议",
          "31"
        ],

        [
          3,
          0,
          1,
          "孙伟",
          " 关系数据库基础与应用",
          "1-2",
          "企业微信会议上课",
          "32"
        ],
        [
          3,
          1,
          1,
          "孙伟",
          " 关系数据库基础与应用",
          "1-2",
          "企业微信会议上课",
          "32"
        ],

        [
          3,
          4,
          1,
          "何亮",
          " Linux系统管理C",
          "5-6",
          "视频直播,学习资料放在学院网络教学平台和企业微信群",
          "签到31人,2人未签到"
        ],
        [
          3,
          5,
          1,
          "何亮",
          " Linux系统管理C",
          "5-6",
          "视频直播,学习资料放在学院网络教学平台和企业微信群",
          "签到31人,2人未签到"
        ]
      ],
      wl19d1: [
        [
          0,
          0,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "QQ、企业微信沟通答疑",
          "43"
        ],
        [
          0,
          1,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "QQ、企业微信沟通答疑",
          "43"
        ],
        [
          0,
          2,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "QQ、企业微信沟通答疑",
          "43"
        ],
        [
          0,
          3,
          1,
          "朱亮",
          " Windows Server配置与管理",
          "1-4",
          "QQ、企业微信沟通答疑",
          "43"
        ],

        [
          0,
          4,
          1,
          "罗颖",
          " 关系数据库基础与应用",
          "5-8",
          "企业微信音频会议,授课多平台课同时发布资源",
          "43"
        ],
        [
          0,
          5,
          1,
          "罗颖",
          " 关系数据库基础与应用",
          "5-8",
          "企业微信音频会议,授课多平台课同时发布资源",
          "43"
        ],
        [
          0,
          6,
          1,
          "罗颖",
          " 关系数据库基础与应用",
          "5-8",
          "企业微信音频会议,授课多平台课同时发布资源",
          "43"
        ],
        [
          0,
          7,
          1,
          "罗颖",
          " 关系数据库基础与应用",
          "5-8",
          "企业微信音频会议,授课多平台课同时发布资源",
          "43"
        ],

        [
          1,
          0,
          1,
          "何亮",
          " Linux系统管理C",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "未说明"
        ],
        [
          1,
          1,
          1,
          "何亮",
          " Linux系统管理C",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "未说明"
        ],
        [
          1,
          2,
          1,
          "何亮",
          " Linux系统管理C",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "未说明"
        ],
        [
          1,
          3,
          1,
          "何亮",
          " Linux系统管理C",
          "1-4",
          "企业微信音频会议,共享屏幕讲课",
          "未说明"
        ],

        [
          2,
          0,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "企业微信语音会议",
          "31"
        ],
        [
          2,
          1,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "企业微信语音会议",
          "31"
        ],
        [
          2,
          2,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "企业微信语音会议",
          "31"
        ],
        [
          2,
          3,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "企业微信语音会议",
          "31"
        ],

        [
          3,
          4,
          1,
          "罗颖",
          " 关系数据库基础与应用",
          "5-6",
          "企业微信音频会议+屏幕分享,云班课提交课堂练习",
          "43"
        ],
        [
          3,
          5,
          1,
          "罗颖",
          " 关系数据库基础与应用",
          "5-6",
          "企业微信音频会议+屏幕分享,云班课提交课堂练习",
          "43"
        ]
      ],
      xg18h1: [
        [
          0,
          0,
          1,
          "汤晓燕",
          " WEB应用程序开发(ASP.NET)",
          "1-4",
          "网络平台学习及讨论，后半部分效果不太理想",
          "24"
        ],
        [
          0,
          1,
          1,
          "汤晓燕",
          " WEB应用程序开发(ASP.NET)",
          "1-4",
          "网络平台学习及讨论，后半部分效果不太理想",
          "24"
        ],
        [
          0,
          2,
          1,
          "汤晓燕",
          " WEB应用程序开发(ASP.NET)",
          "1-4",
          "网络平台学习及讨论，后半部分效果不太理想",
          "24"
        ],
        [
          0,
          3,
          1,
          "汤晓燕",
          " WEB应用程序开发(ASP.NET)",
          "1-4",
          "网络平台学习及讨论，后半部分效果不太理想",
          "24"
        ],

        [0, 4, 1, "吴阅帆", " 客户关系管理B", "5-6", "无", "未说明"],
        [0, 5, 1, "吴阅帆", " 客户关系管理B", "5-6", "无", "未说明"],

        [
          1,
          0,
          1,
          "黄金晶",
          " 软件工程与建模",
          "1-4",
          "企业微信打卡,群内上课解答,网络平台上传视频",
          "36"
        ],
        [
          1,
          1,
          1,
          "黄金晶",
          " 软件工程与建模",
          "1-4",
          "企业微信打卡,群内上课解答,网络平台上传视频",
          "36"
        ],
        [
          1,
          2,
          1,
          "黄金晶",
          " 软件工程与建模",
          "1-4",
          "企业微信打卡,群内上课解答,网络平台上传视频",
          "36"
        ],
        [
          1,
          3,
          1,
          "黄金晶",
          " 软件工程与建模",
          "1-4",
          "企业微信打卡,群内上课解答,网络平台上传视频",
          "36"
        ],

        [
          2,
          0,
          1,
          "沈茜",
          " 虚拟现实项目开发",
          "1-2",
          "语音会议+实践任务+讨论区任务成果分享",
          "36人，1人未到"
        ],
        [
          2,
          1,
          1,
          "沈茜",
          " 虚拟现实项目开发",
          "1-2",
          "语音会议+实践任务+讨论区任务成果分享",
          "36人，1人未到"
        ],

        [
          3,
          4,
          1,
          "李良",
          " 金融数据分析A",
          "5-6",
          "QQ群直播，问卷星扫码做题",
          "37人，迟到2人"
        ],
        [
          3,
          5,
          1,
          "李良",
          " 金融数据分析A",
          "5-6",
          "QQ群直播，问卷星扫码做题",
          "37人，迟到2人"
        ]
      ],
      xx18d1: [
        [
          0,
          0,
          1,
          "沈茜",
          " 客户端脚本框架应用",
          "1-4",
          "无法登上平台，资料发在群里",
          "37人签到，44人企业微信群均在线"
        ],
        [
          0,
          1,
          1,
          "沈茜",
          " 客户端脚本框架应用",
          "1-4",
          "无法登上平台，资料发在群里",
          "37人签到，44人企业微信群均在线"
        ],
        [
          0,
          2,
          1,
          "沈茜",
          " 客户端脚本框架应用",
          "1-4",
          "无法登上平台，资料发在群里",
          "37人签到，44人企业微信群均在线"
        ],
        [
          0,
          3,
          1,
          "沈茜",
          " 客户端脚本框架应用",
          "1-4",
          "无法登上平台，资料发在群里",
          "37人签到，44人企业微信群均在线"
        ],

        [
          1,
          4,
          1,
          "沈茜",
          " 虚拟现实项目开发",
          "5-6",
          "企业微信音频会议+共享屏幕讲课,网络教学平台讨论",
          "51"
        ],
        [
          1,
          5,
          1,
          "沈茜",
          " 虚拟现实项目开发",
          "5-6",
          "企业微信音频会议+共享屏幕讲课,网络教学平台讨论",
          "51"
        ],

        [
          2,
          0,
          1,
          "汤晓燕",
          " WEB应用程序开发（ASP.NET）A",
          "1-4",
          "企业微信音频会议+屏幕分享,网络平台教学资源",
          "51"
        ],
        [
          2,
          1,
          1,
          "汤晓燕",
          " WEB应用程序开发（ASP.NET）A",
          "1-4",
          "企业微信音频会议+屏幕分享,网络平台教学资源",
          "51"
        ],
        [
          2,
          2,
          1,
          "汤晓燕",
          " WEB应用程序开发（ASP.NET）A",
          "1-4",
          "企业微信音频会议+屏幕分享,网络平台教学资源",
          "51"
        ],
        [
          2,
          3,
          1,
          "汤晓燕",
          " WEB应用程序开发（ASP.NET）A",
          "1-4",
          "企业微信音频会议+屏幕分享,网络平台教学资源",
          "51"
        ],

        [
          3,
          0,
          1,
          "芮文艳",
          " 网站运营及维护",
          "1-2",
          "企业微信音频会议+屏幕分享",
          "51"
        ],
        [
          3,
          1,
          1,
          "芮文艳",
          " 网站运营及维护",
          "1-2",
          "企业微信音频会议+屏幕分享",
          "51"
        ]
      ],
      xx19c1: [
        [
          0,
          0,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "QQ演示，平台发布视频",
          "37人签到，40人QQ在线"
        ],
        [
          0,
          1,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "QQ演示，平台发布视频",
          "37人签到，40人QQ在线"
        ],
        [
          0,
          2,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "QQ演示，平台发布视频",
          "37人签到，40人QQ在线"
        ],
        [
          0,
          3,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-4",
          "QQ演示，平台发布视频",
          "37人签到，40人QQ在线"
        ],

        [
          1,
          0,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "网络平台，QQ答疑讨论",
          "41"
        ],
        [
          1,
          1,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "网络平台，QQ答疑讨论",
          "41"
        ],
        [
          1,
          2,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "网络平台，QQ答疑讨论",
          "41"
        ],
        [
          1,
          3,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "网络平台，QQ答疑讨论",
          "41"
        ],

        [
          2,
          0,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "云班课上课，教学资源学习",
          "41人参加，7人迟到"
        ],
        [
          2,
          1,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "云班课上课，教学资源学习",
          "41人参加，7人迟到"
        ],
        [
          2,
          2,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "云班课上课，教学资源学习",
          "41人参加，7人迟到"
        ],
        [
          2,
          3,
          1,
          "胡霞",
          " 关系数据库基础与应用",
          "1-4",
          "云班课上课，教学资源学习",
          "41人参加，7人迟到"
        ],

        [
          3,
          0,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-2",
          "企业微信和云班课教学",
          "40人，1人病假"
        ],
        [
          3,
          1,
          1,
          "陈莉莉",
          " Web前端技术基础",
          "1-2",
          "企业微信和云班课教学",
          "40人，1人病假"
        ],

        [
          4,
          0,
          1,
          "盛永华",
          " 三维物件建模（3dsMax）",
          "1-4",
          "企业微信上课,云班课测试抢答,网络教学平台答疑讨论",
          "41"
        ],
        [
          4,
          1,
          1,
          "盛永华",
          " 三维物件建模（3dsMax）",
          "1-4",
          "企业微信上课,云班课测试抢答,网络教学平台答疑讨论",
          "41"
        ],
        [
          4,
          2,
          1,
          "盛永华",
          " 三维物件建模（3dsMax）",
          "1-4",
          "企业微信上课,云班课测试抢答,网络教学平台答疑讨论",
          "41"
        ],
        [
          4,
          3,
          1,
          "盛永华",
          " 三维物件建模（3dsMax）",
          "1-4",
          "企业微信上课,云班课测试抢答,网络教学平台答疑讨论",
          "41"
        ]
      ],
      xx19d1: [
        [
          0,
          0,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "44"
        ],
        [
          0,
          1,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "44"
        ],
        [
          0,
          2,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "44"
        ],
        [
          0,
          3,
          1,
          "密海英",
          " Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "44"
        ],

        [1, 0, 1, "盛永华", " 三维物件建模（3dsMax）", "1-4"],
        [1, 1, 1, "盛永华", " 三维物件建模（3dsMax）", "1-4"],
        [1, 2, 1, "盛永华", " 三维物件建模（3dsMax）", "1-4"],
        [1, 3, 1, "盛永华", " 三维物件建模（3dsMax）", "1-4"],

        [
          1,
          4,
          1,
          "朱东",
          " 关系数据库基础与应用",
          "5-6",
          "在线学习教学资料及视频,网络教学平台进行答疑讨论",
          "40"
        ],
        [
          1,
          5,
          1,
          "朱东",
          " 关系数据库基础与应用",
          "5-6",
          "在线学习教学资料及视频,网络教学平台进行答疑讨论",
          "40"
        ],

        [
          2,
          0,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "学校网络平台发布视频资源、文档,QQ在线答疑讨论",
          "44"
        ],
        [
          2,
          1,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "学校网络平台发布视频资源、文档,QQ在线答疑讨论",
          "44"
        ],
        [
          2,
          2,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "学校网络平台发布视频资源、文档,QQ在线答疑讨论",
          "44"
        ],
        [
          2,
          3,
          1,
          "陈瑾",
          " Linux系统管理C",
          "1-4",
          "学校网络平台发布视频资源、文档,QQ在线答疑讨论",
          "44"
        ],

        [
          3,
          0,
          1,
          "密海英",
          " Web前端技术基础",
          "1-2",
          "在线与学生互动,提问",
          "2人，2人睡过"
        ],
        [
          3,
          1,
          1,
          "密海英",
          " Web前端技术基础",
          "1-2",
          "在线与学生互动,提问",
          "2人，2人睡过"
        ]
      ],
      yjs18c1: [
        [
          0,
          0,
          1,
          "伊雯雯",
          " Java Web云应用开发",
          "1-4",
          "要求8:10-8:39在群里打卡",
          "按时打卡38人，5人迟到，3人始终没有参与"
        ],
        [
          0,
          1,
          1,
          "伊雯雯",
          " Java Web云应用开发",
          "1-4",
          "要求8:10-8:39在群里打卡",
          "按时打卡38人，5人迟到，3人始终没有参与"
        ],
        [
          0,
          2,
          1,
          "伊雯雯",
          " Java Web云应用开发",
          "1-4",
          "要求8:10-8:39在群里打卡",
          "按时打卡38人，5人迟到，3人始终没有参与"
        ],
        [
          0,
          3,
          1,
          "伊雯雯",
          " Java Web云应用开发",
          "1-4",
          "要求8:10-8:39在群里打卡",
          "按时打卡38人，5人迟到，3人始终没有参与"
        ],

        [
          1,
          0,
          1,
          "张伟华",
          " Android云应用开发",
          "1-4",
          "职教云上传教学视频和PPT和作业,学生在线学习",
          "28"
        ],
        [
          1,
          1,
          1,
          "张伟华",
          " Android云应用开发",
          "1-4",
          "职教云上传教学视频和PPT和作业",
          "28"
        ],
        [
          1,
          2,
          1,
          "张伟华",
          " Android云应用开发",
          "1-4",
          "职教云上传教学视频和PPT和作业",
          "42"
        ],
        [
          1,
          3,
          1,
          "张伟华",
          " Android云应用开发",
          "1-4",
          "职教云上传教学视频和PPT和作业",
          "42"
        ],

        [
          2,
          0,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "教学平台学习,部分学生遇到网络问题，使用群里资料学习",
          "41"
        ],
        [
          2,
          1,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "教学平台学习,部分学生遇到网络问题，使用群里资料学习",
          "41"
        ],
        [
          2,
          2,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "教学平台学习,部分学生遇到网络问题，使用群里资料学习",
          "41"
        ],
        [
          2,
          3,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "教学平台学习,部分学生遇到网络问题，使用群里资料学习",
          "41"
        ],

        [
          3,
          0,
          1,
          "顾红燕",
          " 路由与交换技术",
          "1-4",
          "云班课学习PPT和视频,完成作业,企业微信会议直播",
          "41人，1人请假"
        ],
        [
          3,
          1,
          1,
          "顾红燕",
          " 路由与交换技术",
          "1-4",
          "云班课学习PPT和视频,完成作业,企业微信会议直播",
          "41人，1人请假"
        ],
        [
          3,
          2,
          1,
          "顾红燕",
          " 路由与交换技术",
          "1-4",
          "云班课学习PPT和视频,完成作业,企业微信会议直播",
          "41人，1人请假"
        ],
        [
          3,
          3,
          1,
          "顾红燕",
          " 路由与交换技术",
          "1-4",
          "云班课学习PPT和视频,完成作业,企业微信会议直播",
          "41人，1人请假"
        ],

        [
          3,
          4,
          1,
          "伊雯雯",
          " Java Web云应用开发",
          "5-6",
          "直播授课,发布在线测试、作业,提问5次",
          "38"
        ],
        [
          3,
          5,
          1,
          "伊雯雯",
          " Java Web云应用开发",
          "5-6",
          "直播授课,发布在线测试、作业,提问5次",
          "38"
        ],

        [
          4,
          0,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "理论自学和实验为主",
          "38"
        ],
        [
          4,
          1,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "理论自学和实验为主",
          "38"
        ],
        [
          4,
          2,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "理论自学和实验为主",
          "38"
        ],
        [
          4,
          3,
          1,
          "李文俊",
          " 云计算网络技术与应用",
          "1-4",
          "理论自学和实验为主",
          "38"
        ]
      ],
      yjs19c1: [
        [
          0,
          0,
          1,
          "李文俊",
          "  Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "上午有10个，下午有学生在继续学习"
        ],
        [
          0,
          1,
          1,
          "李文俊",
          "  Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "上午有10个，下午有学生在继续学习"
        ],
        [
          0,
          2,
          1,
          "李文俊",
          "  Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "上午有10个，下午有学生在继续学习"
        ],
        [
          0,
          3,
          1,
          "李文俊",
          "  Linux系统管理C",
          "1-4",
          "网络平台，完成任务提交作业",
          "上午有10个，下午有学生在继续学习"
        ],

        [
          1,
          0,
          1,
          "李良",
          " Python程序设计",
          "1-4",
          "QQ群直播,问卷星做题",
          "38"
        ],
        [
          1,
          1,
          1,
          "李良",
          " Python程序设计",
          "1-4",
          "QQ群直播,问卷星做题",
          "38"
        ],
        [
          1,
          2,
          1,
          "李良",
          " Python程序设计",
          "1-4",
          "QQ群直播,问卷星做题",
          "38"
        ],
        [
          1,
          3,
          1,
          "李良",
          " Python程序设计",
          "1-4",
          "QQ群直播,问卷星做题",
          "38"
        ],

        [
          1,
          4,
          1,
          "张佳磊",
          " Web前端技术基础",
          "5-6",
          "企业微信直播,网络教学平台资源学习",
          "39"
        ],
        [
          1,
          5,
          1,
          "张佳磊",
          " Web前端技术基础",
          "5-6",
          "企业微信直播,网络教学平台资源学习",
          "39"
        ],

        [
          2,
          0,
          1,
          "黄金晶",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播+企业微信群互动交流",
          "37"
        ],
        [
          2,
          1,
          1,
          "黄金晶",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播+企业微信群互动交流",
          "37"
        ],
        [
          2,
          2,
          1,
          "黄金晶",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播+企业微信群互动交流",
          "37"
        ],
        [
          2,
          3,
          1,
          "黄金晶",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播+企业微信群互动交流",
          "37"
        ],

        [
          4,
          0,
          1,
          "张佳磊",
          " Web前端技术基础",
          "1-4",
          "企业微信直播,线上互动,企业微信签到",
          "39"
        ],
        [
          4,
          1,
          1,
          "张佳磊",
          " Web前端技术基础",
          "1-4",
          "企业微信直播,线上互动,企业微信签到",
          "39"
        ],
        [
          4,
          2,
          1,
          "张佳磊",
          " Web前端技术基础",
          "1-4",
          "企业微信直播,线上互动,企业微信签到",
          "39"
        ],
        [
          4,
          3,
          1,
          "张佳磊",
          " Web前端技术基础",
          "1-4",
          "企业微信直播,线上互动,企业微信签到",
          "39"
        ]
      ],
      yjs19c2: [
        [
          0,
          0,
          1,
          "陈园园",
          "  Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "未说明"
        ],
        [
          0,
          1,
          1,
          "陈园园",
          "  Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "未说明"
        ],
        [
          0,
          2,
          1,
          "陈园园",
          "  Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "未说明"
        ],
        [
          0,
          3,
          1,
          "陈园园",
          "  Web前端技术基础",
          "1-4",
          "网络平台，完成任务提交作业",
          "未说明"
        ],

        [
          1,
          0,
          1,
          "孙伟",
          " Python程序设计",
          "1-4",
          "企业微信音频直播+屏幕演示,职教云平台资源自学",
          "38"
        ],
        [
          1,
          1,
          1,
          "孙伟",
          " Python程序设计",
          "1-4",
          "企业微信音频直播+屏幕演示,职教云平台资源自学",
          "38"
        ],
        [
          1,
          2,
          1,
          "孙伟",
          " Python程序设计",
          "1-4",
          "企业微信音频直播+屏幕演示,职教云平台资源自学",
          "38"
        ],
        [
          1,
          3,
          1,
          "孙伟",
          " Python程序设计",
          "1-4",
          "企业微信音频直播+屏幕演示,职教云平台资源自学",
          "38"
        ],

        [
          2,
          0,
          1,
          "陈园园",
          " Web前端技术基础",
          "1-2",
          "企业微信群发布资源,综合教学平台",
          "39"
        ],
        [
          2,
          1,
          1,
          "陈园园",
          " Web前端技术基础",
          "1-2",
          "企业微信群发布资源,综合教学平台",
          "39"
        ],
        [
          2,
          2,
          1,
          "方一新",
          " 关系数据库基础与应用",
          "3-4",
          "网络教学平台,企业微信的语音和互动功能",
          "40"
        ],
        [
          2,
          3,
          1,
          "方一新",
          " 关系数据库基础与应用",
          "3-4",
          "网络教学平台,企业微信的语音和互动功能",
          "40"
        ],

        [
          3,
          4,
          1,
          "李春华",
          " Linux系统管理C",
          "5-6",
          "企业微信语音会议+屏幕分享",
          "40"
        ],
        [
          3,
          5,
          1,
          "李春华",
          " Linux系统管理C",
          "5-6",
          "企业微信语音会议+屏幕分享",
          "40"
        ],

        [
          4,
          0,
          1,
          "方一新",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播,完成学校教学平台上的任务",
          "38"
        ],
        [
          4,
          1,
          1,
          "方一新",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播,完成学校教学平台上的任务",
          "38"
        ],
        [
          4,
          2,
          1,
          "方一新",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播,完成学校教学平台上的任务",
          "40"
        ],
        [
          4,
          3,
          1,
          "方一新",
          " 关系数据库基础与应用",
          "1-4",
          "企业微信直播,完成学校教学平台上的任务",
          "40"
        ]
      ],
      jqr19c1: [
        [
          1,
          0,
          1,
          "雷晖",
          " VC++程序设计",
          "1-2",
          "QQ讨论,屏幕分享,但是效果一般",
          "未说明"
        ],
        [
          1,
          1,
          1,
          "雷晖",
          " VC++程序设计",
          "1-2",
          "QQ讨论,屏幕分享,但是效果一般",
          "未说明"
        ],

        [
          3,
          2,
          1,
          "雷晖",
          " VC++程序设计",
          "3-4",
          "企业微信音频会议+屏幕分享",
          "37"
        ],
        [
          3,
          3,
          1,
          "雷晖",
          " VC++程序设计",
          "3-4",
          "企业微信音频会议+屏幕分享",
          "37"
        ]
      ],
      jqr19c2: [
        [
          2,
          0,
          1,
          "雷晖",
          " VC++程序设计",
          "1-2",
          "企业微信音频会议+屏幕分享",
          "32"
        ],
        [
          2,
          1,
          1,
          "雷晖",
          " VC++程序设计",
          "1-2",
          "企业微信音频会议+屏幕分享",
          "32"
        ],

        [
          4,
          4,
          1,
          "雷晖",
          " VC++程序设计",
          "5-6",
          "企业微信音频会议+屏幕分享",
          "32"
        ],
        [
          4,
          5,
          1,
          "雷晖",
          " VC++程序设计",
          "5-6",
          "企业微信音频会议+屏幕分享",
          "32"
        ]
      ],
      kebiaodata: [
        [
          1,
          4,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],
        [
          1,
          5,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],
        [
          1,
          6,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],
        [
          1,
          7,
          1,
          "伊雯雯",
          "框架编程技术",
          "5-8",
          "职教云平台进行授课,完成相关任务",
          "全班46人正常签到45人"
        ],

        [
          2,
          0,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ],
        [
          2,
          1,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ],
        [
          2,
          2,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ],
        [
          2,
          3,
          1,
          "郝爱语",
          "软件质量保证与测试",
          "1-4",
          "共享教学资源至班级群,自主学习",
          "46"
        ]
      ]
    };
  },
  components: {
    Header,
    videoPlayer
  },
  created () {
    this.resizeFontsize();
    //改变横屏竖屏执行效果更换
    window.addEventListener("orientationchange", this.resizeFontsize());
    //改变手机大小执行效果更换
    window.addEventListener("resize", this.resizeFontsize());

    // 获取宏观统计 总人数、隔离人数、发烧人数
    this.initSum();
    // 获取重点关注学生并无缝滚动
    this.focusStu();
    // 获取停课不停学轮播图
    this.slideShow();
    // 获取未带口罩的图片并无缝滚动
    this.noMaskList();
    // 获取当日值班老师
    this.initzhiban();
  },
  mounted () {
    //播放器自动播放
    this.$refs.videoPlayer.player.play();
    this.$refs.videoPlayer1.player.play();
    //重点关注学生表格、未带口罩的图片无缝滚动
    this.play();
    // 诊　断
    this.WordCould("resou", "/prevent/selectFromDiagnosisTitle");
    // 知　识
    this.WordCould("zhishi", "/prevent/selectFromGuideTitle");
    // 辟　谣
    this.selectRumorTitle();
    // 课表
    this.drawKebiao();
    // 地理分布
    this.map();
    //Top10
    this.proBar();
    // 发烧占比
    this.leidaInfo();
    //选项卡自动播放
    this.tabxunhuan();
    //返苏人数折线图
    this.stuInsz();
  },
  methods: {
    initSum () {
      var self = this;
      self.$http
        .get(this.baseUrl + "/students/sum")
        .then(function (response) {
          var res = response.data;
          self.statistics.sumAll = res.sumAll;
          self.statistics.upTime = res.upTime.slice(5);
          self.statistics.sumGreen = res.sumGreen;
          self.statistics.stuinSuzhou = res.stuinSuzhou;
          self.statistics.stuinJiang = res.stuinJiang;
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    focusStu () {
      var self = this;
      self.$http
        .get(this.baseUrl + "/dayrpt/getFocusStu")
        .then(function (response) {
          self.stuInfo = [];
          var res = response.data;
          for (var i = 0; i < res.length; i++) {
            if (res[i].STATUS == "隔离") {
              if (res[i].quarantine == 0) {
                res[i].quarantine = "在家";
              } else {
                res[i].quarantine = "医院";
              }
            } else {
              res[i].quarantine = "无";
            }
            if (res[i].s_name[0] != "undefined") {
              res[i].s_name = res[i].s_name[0] + "**";
            }
            self.stuInfo.push({
              name: res[i].s_name,
              class: res[i].c_name,
              tem: res[i].temperature,
              status: res[i].STATUS,
              address: res[i].quarantine
            });
          }
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    slideShow () {
      var self = this;
      self.$http
        .get(this.baseUrl + "/pictures/selectByType?type=1")
        .then(function (response) {
          var res = response.data;
          self.img_list = res;
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    noMaskList () {
      var self = this;
      self.$http
        .get(this.baseUrl + "/pictures/selectByType?type=3")
        .then(function (response) {
          var res = response.data;
          self.noMask = res;
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    initzhiban () {
      var self = this;
      self.$http
        .get(this.baseUrl + "/lineclass/dutyteacher")
        .then(function (response) {
          self.zhiban = response.data[0].t_name;
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    WordCould (id, url) {
      var wordcould = echarts.init(document.getElementById(id));
      const option = {
        series: [
          {
            type: "wordCloud",
            gridSize: 10,
            sizeRange: [14, 60],
            rotationRange: [0, 0],
            left: "center",
            top: "center",
            right: null,
            bottom: null,
            width: "100%",
            height: "100%",
            textStyle: {
              normal: {
                color: function () {
                  return (
                    "rgb(" +
                    [
                      Math.round(Math.random() * 105) + 150,
                      Math.round(Math.random() * 105) + 150,
                      Math.round(Math.random() * 105) + 150
                    ].join(",") +
                    ")"
                  );
                }
              },
              emphasis: {
                shadowBlur: 10,
                shadowColor: "#333"
              }
            },
            data: []
          }
        ]
      };
      wordcould.setOption(option);

      var self = this;
      self.$http
        .get(this.baseUrl + url)
        .then(function (response) {
          var res = response.data;
          var newres = [];
          res = JSON.parse(JSON.stringify(res).replace(/title/g, "name"));
          res = res.map(obj => {
            return {
              name: obj.name
            };
          });
          res.map((item, index) => {
            newres.push(
              Object.assign({}, item, {
                value: Math.round(Math.random() * 10000)
              })
            );
          });

          option.series[0].data = newres.slice(0, 50);
          wordcould.setOption(option);
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    selectRumorTitle () {
      var self = this;
      self.$http
        .get(this.baseUrl + "/prevent/selectRumorTitle")
        .then(function (response) {
          var res = response.data;
          self.piyao = res.slice(0, 20);
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    drawKebiao () {
      var kebiao = echarts.init(document.getElementById("echart6"));

      const option = {
        color: "rgba(39,180,194,0.8)",
        textStyle: {
          fontSize: "150%"
        },
        tooltip: {
          position: "top",
          trigger: "item",
          formatter: function (value) {
            let res =
              "课程情况" +
              "<br/>课程名称：" +
              value.data[4] +
              "<br/>上课情况：" +
              value.data[6] +
              "<br/>考勤：" +
              value.data[7];
            return res;
          },
          axisPointer: {
            type: "shadow"
          }
        },
        animation: false,
        grid: {
          bottom: "2%",
          top: "2%",
          left: "2%",
          right: "2%",
          containLabel: true
        },
        xAxis: {
          position: "top",
          type: "category",
          data: [],
          splitArea: {
            show: true
          },
          axisTick: {
            lineStyle: {
              color: "#1bb4f6"
            }
          },
          axisLabel: {
            color: "#27b4c2"
            // fontSize: "150%"
          },
          axisLine: {
            lineStyle: {
              color: "#1bb4f6"
            }
          }
        },
        yAxis: {
          name: "节次",
          nameLocation: "start",
          inverse: true,
          nameTextStyle: {
            color: "#27b4c2",
            // fontSize:'150%',
            padding: -12
          },
          type: "category",
          data: [],
          splitArea: {
            show: true
          },
          axisTick: {
            lineStyle: {
              color: "#1bb4f6"
            }
          },
          axisLabel: {
            color: "#27b4c2"
            // fontSize: "150%"
          },
          axisLine: {
            lineStyle: {
              color: "#1bb4f6"
            }
          }
        },
        series: [
          {
            name: "课程信息",
            type: "heatmap",
            data: [],
            label: {
              show: true,
              formatter: function (value) {
                let res = value.data[3];
                return res;
              }
            },
            emphasis: {
              itemStyle: {
                shadowBlur: 10,
                shadowColor: "rgba(0, 0, 0, 0.5)"
              }
            }
          }
        ]
      };

      kebiao.setOption(option);

      (option.xAxis.data = ["周一", "周二", "周三", "周四", "周五"]),
        (option.yAxis.data = ["1", "2", "3", "4", "5", "6", "7", "8"]);
      option.series[0].data = this.kebiaodata;
      kebiao.setOption(option);
    },
    map () {
      var myChart = echarts.init(document.getElementById("map_1"));
      var geoCoordMap = {};
      var mapFeatures = echarts.getMap("china").geoJson.features;
      mapFeatures.forEach(function (v) {
        // 地区名称
        var name = v.properties.name;
        // console.log(name);
        // 地区经纬度
        geoCoordMap[name] = v.properties.cp;
      });
      var convertData = function (data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
          var geoCoord = geoCoordMap[data[i].location_province];
          if (geoCoord) {
            res.push({
              name: data[i].location_province,
              value: geoCoord.concat(data[i].count)
            });
          }
        }
        return res;
      };
      var option = {
        title: {
          text: "学生地理分布",
          subtext: "数据来源 苏工院",
          sublink: "#",
          top: "5%",
          left: "center",
          textStyle: {
            color: "#fff"
          }
        },
        tooltip: {
          trigger: "item",
          formatter: function (params) {
            if (typeof params.value[2] == "undefined") {
              return (
                option.series[0].name +
                "<br/>" +
                params.name +
                " : " +
                params.value
              );
            } else {
              return params.name + " : " + params.value[2];
            }
          }
        },
        //是视觉映射组件，用于进行『视觉编码』，也就是将数据映射到视觉元素（视觉通道）。
        visualMap: {
          show: false,
          min: 0, //最小值
          max: 100, //最大值
          left: "25%",
          bottom: "5%",
          calculable: true, //是否显示拖拽用的手柄（手柄能拖拽调整选中范围）。
          seriesIndex: [0], //不会覆盖其他type颜色
          inRange: {
            color: ["#edfbfb", "#b7d6f3", "#40a9ed", "#3598c1", "#215096"] //颜色
          },
          textStyle: {
            color: "#fff"
          }
        },
        geo: {
          map: "china",
          label: {
            emphasis: {
              show: false
            }
          },
          roam: false,
          itemStyle: {
            normal: {
              areaColor: "#4c60ff",
              borderColor: "#002097"
            },
            emphasis: {
              areaColor: "#293fff"
            }
          }
        },
        series: [
          {
            name: "学生人数",
            type: "map",
            geoIndex: 0,
            showLegendSymbol: false,
            label: {
              normal: {
                show: true
              },
              emphasis: {
                show: false,
                textStyle: {
                  color: "#fff"
                }
              }
            },
            roam: true,
            itemStyle: {
              normal: {
                areaColor: "#031525",
                borderColor: "#3B5077"
              },
              emphasis: {
                areaColor: "#2B91B7"
              }
            },
            animation: true,
            data: []
          },
          {
            name: "重点疫区",
            type: "effectScatter",
            data: [],
            coordinateSystem: "geo",
            symbolSize: 15,
            showEffectOn: "render",
            rippleEffect: {
              brushType: "stroke"
            },
            hoverAnimation: true,
            label: {
              normal: {
                formatter: "{b}",
                position: "right",
                show: true,
                textStyle: {
                  color: "#fff"
                },
                backgroundColor: "rgba(0,0,0,0.5)"
              }
            },
            itemStyle: {
              show: true,
              normal: {
                color: "#FF5000",
                shadowBlur: 10,
                shadowColor: "#FF5000"
              }
            },
            zlevel: 1
          }
        ]
      };
      myChart.setOption(option);

      var self = this;
      self.$http
        .get(this.baseUrl + "/students/getStuInProvince")
        .then(function (response) {
          var dd = [];
          var res = response.data.results;
          for (var i = 0; i < res.length; i++) {
            dd.push({
              name: res[i]._id,
              value: res[i].总人数
            });
          }
          option.series[0].data = dd;
          myChart.setOption(option);
        });
      //重点疫区
      self.$http
        .get(this.baseUrl + "/dayrpt/getStuInProvince")
        .then(function (response) {
          var keyarea = [];
          var res = response.data;
          for (var i = 0; i < res.length; i++) {
            if (res[i].location_province == "湖北") {
              keyarea.push({
                location_province: res[i].location_province,
                count: res[i].count
              });
            }
          }
          option.series[1].data = convertData(keyarea);
          myChart.setOption(option);
        });

      var index = 0;
      self.timer = setInterval(function () {
        myChart.dispatchAction({
          type: "showTip",
          seriesIndex: 0,
          dataIndex: index
        });
        index++;
        if (index > 34) {
          index = 0;
        }
      }, 2000);
      window.addEventListener("resize", function () {
        myChart.resize();
      });
    },
    handleClick (tab, event) {
      // console.log(tab, event);
    },
    handleClick2 (row) {
      alert(row);
    },
    // 切换班级课表
    handleCommand1 (command) {
      this.kebiaodata = eval("this." + command);
      // if(command = "rj18c2")
      //   this.class = "软件18C2";
      switch (command) {
        case "rj18c2":
          this.class = "软件18C2";
          break;
        case "rj18c1":
          this.class = "软件18C1";
          break;
        case "dsj18c1":
          this.class = "大数据18C1";
          break;
        case "dl18c1":
          this.class = "动联18C1";
          break;
        case "wl18c1":
          this.class = "网络18C1";
          break;
        case "wl18d1":
          this.class = "网络18D1";
          break;
        case "xg18h1":
          this.class = "信管18H1";
          break;
        case "xx18d1":
          this.class = "信息18D1";
          break;
        case "yjs18c1":
          this.class = "云计算18C1";
          break;
      }
      this.drawKebiao();
    },
    handleCommand2 (command) {
      this.kebiaodata = eval("this." + command);
      switch (command) {
        case "rj19c2":
          this.class = "软件19C2";
          break;
        case "rj19c1":
          this.class = "软件16C1";
          break;
        case "dsj19c1":
          this.class = "大数据19C1";
          break;
        case "dl19c1":
          this.class = "动联19C1";
          break;
        case "wl19c1":
          this.class = "网络19C1";
          break;
        case "wl19d1":
          this.class = "网络19D1";
          break;
        case "xx19d1":
          this.class = "信息19D1";
          break;
        case "xx19c1":
          this.class = "信息19C1";
          break;
        case "yjs19c1":
          this.class = "云计算19C1";
          break;
        case "yjs19c2":
          this.class = "云计算19C2";
          break;
        case "jqr19c1":
          this.class = "机器人19C1";
          break;
        case "jqr19c2":
          this.class = "机器人19C2";
          break;
      }
      this.drawKebiao();
    },
    proBar () {
      var myChart = echarts.init(document.getElementById("polo_2"));
      var color = [
        "#2EC7E6",
        "#FF5500",
        "#FFDD33",
        "#2FC25B",
        "#3063FF",
        "#2EC7E6",
        "#FF5500",
        "#FFDD33",
        "#2FC25B",
        "#3063FF"
      ];
      var option = {
        title: {
          text: "各省分布人数Top10",
          // sublink: "#",
          top: 0,
          left: "center",
          textStyle: {
            color: "#fff",
            fontSize: "150%"
          }
        },
        tooltip: {
          trigger: "axis",
          axisPointer: {
            type: "shadow"
          },
          formatter: function (objs, index) {
            let obj = objs[0];
            return `${obj.name}<br/>${obj.marker}${obj.seriesName} : ${obj.value}`;
          }
        },
        grid: {
          top: "3%",
          left: "3%",
          right: "6%",
          bottom: "1%",
          containLabel: true
        },
        xAxis: {
          type: "value",
          splitLine: {
            show: false
          },
          axisLabel: {
            show: false
          },
          axisLine: {
            show: false, //隐藏y轴坐标轴线
            lineStyle: {
              color: "#00D4C7"
              // rotate:20
            }
          },
          axisTick: {
            show: false
          }
        },
        yAxis: {
          type: "category",
          boundaryGap: true,
          //倒序
          inverse: true,
          axisTick: {
            //y轴刻度线
            show: false
          },
          axisLabel: {
            //y轴文本旋转角度
            // rotate: 30
            fontSize: "150%"
          },
          axisLine: {
            show: false,
            lineStyle: {
              color: "#00D4C7"
            }
          },
          data: []
        },
        series: [
          {
            name: "分布人数",
            barMaxWidth: 15, //柱状宽度
            type: "bar",
            label: {
              normal: {
                show: true,
                position: "right",
                textStyle: {
                  color: "#ffffff",
                  fontSize: "12"
                }
              }
            },
            data: []
          }
        ]
      };
      myChart.setOption(option);
      var self = this;
      self.$http
        .get(this.baseUrl + "/dayrpt/getStuInProvince")
        .then(function (response) {
          var res = response.data;
          var provinces = [];
          var pronum = [];
          for (var i = 0; i < res.length; i++) {
            provinces.push(res[i].location_province);
            pronum.push(res[i].count);
          }
          //取前十
          option.yAxis.data = provinces.slice(0, 10);
          option.series[0].data = pronum.slice(0, 10).map(function (item, i) {
            return {
              value: item,
              itemStyle: {
                color: color[i]
              }
            };
          });
          myChart.setOption(option);
        });
      window.addEventListener("resize", function () {
        myChart.resize();
      });
    },
    stuInsz () {
      var myChart = echarts.init(document.getElementById("polo_1"));
      var option = {
        grid: {
          left: "1%",
          right: "1%",
          top: "20%",
          bottom: "1%",
          containLabel: true
        },
        tooltip: {
          show: true
        },
        legend: {
          show: true,
          x: "center",
          y: "2%",
          icon: "stack",
          itemWidth: 6,
          itemHeight: 6,
          textStyle: {
            color: "#dcdcdc",
            fontSize: "150%"
          },
          data: ["苏州人数趋势", "江苏人数趋势"]
        },
        xAxis: [
          {
            axisLine: {
              show: true //隐藏X轴轴线
            },
            axisTick: {
              show: true //隐藏X轴刻度
            },
            axisLabel: {
              show: true,
              textStyle: {
                color: "#2ad1d2" //X轴文字颜色
              }
            },
            axisLine: {
              lineStyle: {
                color: "#01FCE3"
              }
            },
            data: []
          }
        ],
        yAxis: [
          {
            type: "value",
            // name: "人数",
            axisLabel: {
              formatter: "{value}",
              textStyle: {
                color: "#2ad1d2",
                fontSize: "150%"
              }
            },
            axisLine: {
              lineStyle: {
                color: "#27b4c2"
              }
            },
            axisTick: {
              show: false
            },
            splitLine: {
              show: false,
              lineStyle: {
                color: "#11366e"
              }
            }
          },
          {
            type: "value",
            // name: "人数",
            min: 0,
            max: 1200,
            axisLabel: {
              formatter: "{value}",
              textStyle: {
                color: "#2ad1d2",
                fontSize: "150%"
              }
            },
            axisLine: {
              lineStyle: {
                color: "#27b4c2"
              }
            },
            axisTick: {
              show: false
            },
            splitLine: {
              show: false,
              lineStyle: {
                color: "#11366e"
              }
            }
          }
        ],
        series: [
          {
            name: "苏州人数趋势",
            type: "line",
            stack: "总量",
            symbol: "circle",
            symbolSize: 6,
            itemStyle: {
              normal: {
                color: "#4169E1",
                lineStyle: {
                  color: "#4169E1",
                  width: 1
                },
                areaStyle: {
                  //color: '#94C9EC'
                  color: new echarts.graphic.LinearGradient(0, 1, 0, 0, [
                    {
                      offset: 0,
                      color: "rgba(0,146,246,0.7)"
                    },
                    {
                      offset: 1,
                      color: "rgba(0,146,246,0.5)"
                    }
                  ])
                }
              }
            },
            markPoint: {
              itemStyle: {
                normal: {
                  color: "red"
                }
              }
            },
            data: []
          },
          {
            name: "江苏人数趋势",
            type: "bar",
            //双Y轴时使用
            yAxisIndex: 1,
            barWidth: 15,
            itemStyle: {
              normal: {
                color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [
                  {
                    offset: 0,
                    color: "#00FFE3"
                  },
                  {
                    offset: 1,
                    color: "#4693EC"
                  }
                ])
              }
            },
            data: []
          }
        ]
      };
      myChart.setOption(option);

      var self = this;
      self.$http
        .get(this.baseUrl + "/students/getCityOrProvince?province=江苏")
        .then(function (response) {
          var res = response.data;
          var Num_js = [];
          for (var i = 0; i < res.length; i++) {
            Num_js.push(res[i].ProvinceCount);
          }
          option.series[1].data = Num_js.reverse();;
          myChart.setOption(option);
        });
      self.$http
        .get(this.baseUrl + "/students/getCityOrProvince?city=苏州")
        .then(function (response) {
          var res = response.data;
          var Num_suzhou = [];
          var days = [];
          for (var i = 0; i < res.length; i++) {
            Num_suzhou.push(res[i].CityCount);
            days.push(res[i].upTime.slice(8, 10) + "日");
          }
          days = days.reverse();
          option.series[0].data = Num_suzhou.reverse();;
          option.xAxis[0].data = days;
          myChart.setOption(option);
        });

      window.addEventListener("resize", function () {
        myChart.resize();
      });
    },
    resizeFontsize () {
      var width = document.documentElement.clientWidth;
      document.documentElement.style.fontSize = width / 20 + "px";
    },
    //change,play实现表格自动滚动
    play () {
      //每两秒执行一次插入删除操作
      this.timer = setInterval(this.change, 1000);
      this.timer = setInterval(this.gundong, 1000);
    },
    change () {
      //把第一条数据插入数组最后一条
      this.stuInfo.push(this.stuInfo[0]);
      //删除数组中第一条数据
      this.stuInfo.shift();
    },
    gundong () {
      this.noMask.push(this.noMask[0]);
      this.noMask.shift();
    },
    tabchange () {
      if (this.activename == "name1") {
        this.activename = "name2";
      } else if (this.activename == "name2") {
        this.activename = "name3";
      } else if (this.activename == "name3") {
        this.activename = "name1";
      }
    },
    tabxunhuan () {
      this.timer = setInterval(this.tabchange, 5000);
    },
    leidaInfo () {
      var self = this;
      var placeHolderStyle = {
        normal: {
          label: {
            show: false
          },
          labelLine: {
            show: false
          },
          color: 'rgba(0, 0, 0, 0)',
          borderColor: 'rgba(0, 0, 0, 0)',
          borderWidth: 0
        }
      };

      var color = ["#F8F106", "#33FFCC", "#eb2100", "#33CCFF"]
      self.$http
        .get(this.baseUrl + "/students/getCodeRegisterCount")
        .then(function (response) {
          var res = response.data.results;
          for (var i = 0; i < res.length; i++) {
            self.sucityNum.push({
              value: res[i].持码人数,
              name: res[i]._id,
              itemStyle: {
                normal: {
                  borderWidth: 2,
                  shadowBlur: 10,
                  borderColor: color[i],
                  shadowColor: color[i]
                }
              }
            })
          }

          for (var i = 0; i < self.sucityNum.length; i++) {
            if (self.sucityNum[i].name == "红码") {

            }
          }

          self.sucityNum.push({ value: 0, name: '红码' })

          self.drawLeida();
          // console.log(res);
        })
        .catch(function (error) {
          console.log(error);
        });
    },
    //苏城码
    drawLeida () {
      var myChart = echarts.init(document.getElementById("main8"));
      const option = {
        color: ["#F8F106", "#33FFCC", "#eb2100", "#33CCFF"],
        tooltip: {
          trigger: "item",
          formatter: "{a} <br/>{b} : {c} ({d}%)"
        },
        tooltip: {
          show: false
        },
        series: [
          {
            name: "苏城码",
            type: "pie",
            radius: ["45%", "55%"],
            center: ["50%", "65%"],
            clockWise: false,
            hoverAnimation: false,
            itemStyle: {
              normal: {
                label: {
                  show: true,
                  position: 'outside',
                  color: '#ddd',
                  formatter: (params) => {
                    var percent = 0;
                    var total = 0;
                    for (var i = 0; i < this.sucityNum.length; i++) {
                      total += this.sucityNum[i].value;
                    }
                    percent = ((params.value / total) * 100).toFixed(0);
                    if (params.name !== '') {
                      return '\n' + params.name + ' ：' + params.value + '\n' + '\n' + '占百分比：' + percent + '%';
                    } else {
                      return '';
                    }
                  },
                },
                labelLine: {
                  length: 10,
                  length2: 50,
                  show: true,
                  color: '#00ffff'
                }
              }
            },
            data: this.sucityNum
          }
        ]
      };
      myChart.setOption(option);
      window.addEventListener("resize", function () {
        myChart.resize();
      });
    }
  },
  beforeDestroy () {
    clearInterval(this.timer); // 清除定时器
    this.timer = null;
  }
};
</script>

<style lang="less" >
.myvideo {
  width: 100%;
  height: 100%;
  object-fit: fill;
}

#echart3 .ivu-tabs.ivu-tabs-card > .ivu-tabs-bar .ivu-tabs-tab {
  width: 55.8% !important;
  font-size: 0.183rem !important;
  text-align: center !important;
  border: 1px solid rgba(25, 186, 139, 0.17) !important;
  box-shadow: 0px 0px 10px rgba(25, 140, 186, 0.6) inset !important;
  background: rgba(255, 255, 255, 0.08) url("../assets/images/line.png") !important;
}

#echart3 .ivu-tabs-tabpane {
  width: 100%;
  height: 100%;
}
#echart3 .ivu-tabs-content {
  height: calc(87% - 15px);
}
#echart3 .ivu-tabs {
  height: 93%;
}
#resou {
  width: 100%;
  height: 100%;
}
#piyao {
  width: 100%;
  height: 100%;
}
#zhishi {
  width: 100%;
  height: 100%;
}
#echart6 {
  width: 100%;
  padding: 0.1rem;
  height: 2.3rem;
}

.el-table__header {
  padding: 0;
  height: 5%;
}
.el-table__body,
.el-table__footer,
.el-table__header {
  table-layout: fixed;
  border-collapse: separate;
  width: auto !important;
}
#demo {
  overflow: hidden;

  width: 100%;
  height: 100%;
}

#demo img {
  height: 100%;
  margin-right: 3px;
}

#indemo {
  float: left;
  width: 800%;
  height: 100%;
}

#demo1 {
  float: left;
  height: 100%;
}

#demo2 {
  float: left;

  height: 100%;
}
.piyao {
  height: 100%;
  width: 100%;
  overflow-y: hidden;
}
.piyao:hover {
  overflow-y: scroll;
}
.piyao ul {
  height: 100%;
  width: 100%;
}
.piyao_list1 {
  height: calc(100% / 8);
  width: 100%;
  padding-left: 5px;
  font-size: 0.17rem;
  color: azure;
  border: 1px solid rgba(25, 186, 139, 0.17);
  border-radius: 5px;
  background: rgba(255, 255, 255, 0.08) url("../assets/images/line.png");
  box-shadow: 0px 0px 5px rgba(25, 108, 186, 0.6) inset;
  margin-bottom: 1.2%;
  padding-top: 1%;

  list-style-position: inside;
  list-style-image: url("../assets/images/icon1.png");
}

// #fashao {
//   width: 80%;
//   margin: 0 auto;
//   height: 0.75rem;
// }
.el-dropdown-link {
  cursor: pointer;
  color: #1bb4f6;
  font-size: 0.15rem;
}
.select {
  width: 25%;
  float: left;
  height: 100%;
}
.kebiaotitle1 {
  width: 38%;
  float: left;
  height: 100%;
}
.zhiban {
  width: 22%;
  float: left;
  height: 100%;
  color: #1bb4f6;
  font-size: 0.16rem;
}
.kebiaotitle {
  height: 0.5rem;
  text-align: center;
  font-size: 0.2rem;
  color: #fff;
  text-align: center;
  line-height: 0.5rem;
}
// element.style {
//   margin-top: 35px;
// }

.ivu-tabs.ivu-tabs-card > .ivu-tabs-bar .ivu-tabs-nav-container {
  height: 0.4rem !important;
}
.ivu-tabs.ivu-tabs-card > .ivu-tabs-bar .ivu-tabs-tab {
  height: 0.4rem !important;
}
.ivu-tabs-nav {
  padding-left: 0 !important;
}
.ivu-tabs-nav-container:focus .ivu-tabs-tab-focused {
  border-color: #00d4c7;
}
.ivu-tabs.ivu-tabs-card > .ivu-tabs-bar .ivu-tabs-tab-active {
  color: #00d4c7;
}
.ivu-tabs-bar {
  margin-bottom: 5%;
  border-bottom: 1px solid #00d4c7;
}
.ivu-tabs.ivu-tabs-card > .ivu-tabs-bar .ivu-tabs-nav-wrap {
  margin-left: 0;
}
.map41 {
  width: 100%;
  height: 4rem;
  position: absolute;
  left: -20%;
  margin-top: 0.15rem;
  /* padding-top: 1.5rem; */
  z-index: 5;
}
#main8 {
  width: 100%;
  height: inherit;
}
.el-dropdown-link {
  font-size: 0.15rem !important;
}
.ivu-tabs.ivu-tabs-card > .ivu-tabs-bar .ivu-tabs-nav-wrap {
  margin-left: 0% !important;
}
</style>
